<?php

return array(
    //_Error
    0x000100 => '出错信息',
    0x000101 => '函数调用过程',
    0x000102 => '%s():加载[%s]时发生错误,不能读取文件.[%s]',
    0x010103 => '%s():数据库连接失败!',
    0x010104 => '%s():参数 %s 的类型不是数组!',
    //Core
    0x010101 => '[%s]页面不存在.',
    0x010102 => '%s():文件中没有定义动作处理的类.[%s]',
    0x010103 => '%s():%s 不是一个动作类.[%s]',
    0x010104 => '%s():没有定义动作类的执行入口.[%s]',
    0x010105 => '你已经登录超时了,请重新登录...',
    0x010106 => '重新登录',
    0x010107 => '对不起!你没有执行该操作的权限!',
    0x010108 => '%s():尝试创建GroupId为[%s]的权限缓存时发生错误,原因未知.[%s]',
    //IO
    0x020101 => '%s():禁止操作的路径[%s]',
    0x020102 => '%s():目录级数超过50,不允许创建.[%s]',
    0x020103 => '%s():写入文件失败.[%s]',
    0x020104 => '%s():禁止操作的路径.[%s]',
    0x020105 => '%s():删除[%s]文件%s',
    //Language
    0x030101 => '%s():找不到相应的语言文件.[%s]',
    //Page
    0x040101 => '%s():加载模板文件时发生错误,不能读取文件.[%s]',
);
?>
